In [4]:
import numpy as np
data0=[2,4,6.5,8]
arr0=np.array(data0)

In [5]:
import pandas as pd

In [6]:
s = pd.Series(data=[100,'a',{'dic1':5}],
     index=pd.Index(['id1',20,'third'],name='my_idx'),
      dtype='object',
        name='my_name')

In [7]:
s2=pd.Series(["1","2","3","4"])

In [8]:
s2.index.values

array([0, 1, 2, 3], dtype=int64)

In [9]:
type(s2.values[0])

str

In [10]:
s2.shape

(4,)

In [11]:
s2.size

4

pd.Series(['活着', '许三观', '兄弟'    函数的返回值
"余华"   字符串
 {
    "作者":pd.Series(['余华','残雪','莫言']),
    "作品":pd.Series(['活着','不知道','红高粱']),
    "价格":pd.Series(['22','21','20'])
}   字典

In [12]:
#任务3：创建dataframe类型数据，并获取其索引，值及表大小
d = {
"余华": pd.Series(['活着', '许三观', '兄弟'],),
"two": pd.Series([1.0, 2.0, 3.0,],),
"three":pd.Series([1.0, 2.0, 3.0,],)
}
df = pd.DataFrame(d)

使用字典，等号后是一个赋值表达式

In [13]:
#任务3：创建dataframe类型数据，并获取其索引，值及表大小
d = {
"one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
"two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}
df = pd.DataFrame(d)

df2=pd.DataFrame(d1)   赋值表达式 数据框

In [14]:
d1= {
    "作者":pd.Series(['余华','残雪','莫言']),
    "作品":pd.Series(['活着','不知道','红高粱']),
    "价格":pd.Series(['22','21','20'])
}
df2=pd.DataFrame(d1)

In [15]:
df2.index.values

array([0, 1, 2], dtype=int64)

In [16]:
df2.shape

(3, 3)

In [17]:
df2.size

9

df2['作品']   索引获取df2表格中的作品

In [18]:
df2['作品']

0     活着
1    不知道
2    红高粱
Name: 作品, dtype: object

In [19]:
data0=[2,4,6.5,8]
arr0=np.array(data0)

In [20]:
import pandas as pd  
  
贵州茅台原始数据 = pd.read_csv('600519.csv')

In [21]:
贵州茅台原始数据

,day,STOCK_CODE,open,close,maximum,minimum,volume,TURNOVER
0,2001-08-27,6005191,34.51,35.55,37.78,32.85,406318,1410347008
1,2001-08-28,6005191,34.99,36.86,37.00,34.61,129647,463463008
2,2001-08-29,6005191,36.98,36.38,37.00,36.10,53252,194689000
3,2001-08-30,6005191,36.28,37.10,37.51,36.00,48013,177558000
4,2001-08-31,6005191,37.15,37.01,37.62,36.80,23231,86231000
...,...,...,...,...,...,...,...,...
4089,2018-10-29,6005191,549.09,549.09,549.09,549.09,49076,2694714080
4090,2018-10-30,6005191,510.00,524.00,543.00,509.02,204397,10663392512
4091,2018-10-31,6005191,527.00,548.90,555.00,522.00,96885,5239853056
4092,2018-11-01,6005191,555.00,563.00,585.50,551.25,98107,5581027328
4093,2018-11-02,6005191,585.00,599.90,600.00,572.24,89157,5227695104

In [22]:
#按列查询数据

In [23]:
#按行查询数据
贵州茅台原始数据.loc(0)

In [24]:
贵州茅台=贵州茅台原始数据.set_index('day')

In [25]:
# loc索引器
贵州茅台.loc['2001-08-27',]

STOCK_CODE    6.005191e+06
open          3.451000e+01
close         3.555000e+01
maximum       3.778000e+01
minimum       3.285000e+01
volume        4.063180e+05
TURNOVER      1.410347e+09
Name: 2001-08-27, dtype: float64

In [26]:
贵州茅台.loc['2001-08-27',['open','close']]

open     34.51
close    35.55
Name: 2001-08-27, dtype: float64

In [27]:
贵州茅台.loc['2001-10-08',['open','close']]

open     37.00
close    36.58
Name: 2001-10-08, dtype: float64

In [29]:
贵州茅台.loc['2001-08-27':'2001-10-08','open']

day
2001-08-27    34.51
2001-08-28    34.99
2001-08-29    36.98
2001-08-30    36.28
2001-08-31    37.15
2001-09-03    37.20
2001-09-04    37.01
2001-09-05    37.61
2001-09-06    37.35
2001-09-07    36.50
2001-09-10    35.40
2001-09-11    36.80
2001-09-12    35.33
2001-09-13    36.01
2001-09-14    36.01
2001-09-17    36.08
2001-09-18    35.88
2001-09-19    36.30
2001-09-20    36.90
2001-09-21    36.28
2001-09-24    36.06
2001-09-25    36.28
2001-09-26    36.11
2001-09-27    36.08
2001-09-28    36.90
2001-10-08    37.00
Name: open, dtype: float64

In [32]:
条件1=贵州茅台['open']<35
条件2=贵州茅台['close']<35
布尔列表=条件1&条件2
贵州茅台.loc[布尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [33]:
#使用函数作为索引
def condition(pd):
    条件1=贵州茅台['open']<35
    条件2=贵州茅台['close']<35
    布尔列表=条件1&条件2
    return 布尔列表

In [34]:
贵州茅台.loc[condition]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [41]:
贵州茅台.query('open<35 and close<35')[['open','close']]

             open  close
day
2001-10-17  34.79  34.20
2001-10-18  34.20  34.04
2001-10-19  34.00  33.50
2001-10-22  33.30  32.79
2001-11-08  33.35  33.70
...           ...    ...
2004-09-21  32.09  32.30
2004-09-22  32.03  32.16
2004-09-23  32.11  33.42
2004-09-24  33.60  34.49
2004-09-27  34.95  34.93

[498 rows x 2 columns]

In [43]:
贵州茅台.sample(10)

            STOCK_CODE    open   close  maximum  minimum  volume    TURNOVER
day
2016-07-29     6005191  315.08  313.15   318.88   313.00   29007   913987184
2016-01-12     6005191  201.10  196.79   202.10   196.00   40287   801495584
2002-09-04     6005191   30.63   30.59    30.79    30.42    1789     5457397
2009-03-09     6005191  118.24  114.90   119.50   114.88   23152   268799952
2008-08-19     6005191  142.09  144.02   146.81   142.09    6270    90342081
2009-06-01     6005191  115.01  117.76   118.10   114.71   45920   537473264
2009-03-30     6005191  114.00  114.06   115.00   112.10   24269   276929280
2016-11-29     6005191  320.70  323.96   330.45   319.41   58831  1911874432
2009-12-28     6005191  170.20  170.40   171.96   169.50   27905   474640192
2009-09-17     6005191  164.80  164.77   165.75   164.41   16694   275360256

In [44]:
贵州茅台.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4094 entries, 2001-08-27 to 2018-11-02
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STOCK_CODE  4094 non-null   int64
 1   open        4094 non-null   float64
 2   close       4094 non-null   float64
 3   maximum     4094 non-null   float64
 4   minimum     4094 non-null   float64
 5   volume      4094 non-null   int64
 6   TURNOVER    4094 non-null   int64
dtypes: float64(4), int64(3)
memory usage: 384.9+ KB

In [45]:
贵州茅台['open'].describe()

count    4094.000000
mean      182.161910
std       165.857882
min        20.900000
25%        47.405000
50%       159.930000
75%       208.500000
max       800.000000
Name: open, dtype: float64

In [47]:
贵州茅台.describe()

,STOCK_CODE,open,close,maximum,minimum,volume,TURNOVER
count,4094.0,4094.000000,4094.000000,4094.000000,4094.000000,4094.000000,4.094000e+03
mean,6005191.0,182.161910,182.435230,184.879680,179.801353,27092.525892,6.487986e+08
std,0.0,165.857882,165.994905,168.082099,163.752065,24623.472099,9.550262e+08
min,6005191.0,20.900000,20.880000,21.000000,20.710000,238.000000,1.421413e+06
25%,6005191.0,47.405000,47.482500,48.222500,46.705000,10186.750000,6.203505e+07
50%,6005191.0,159.930000,159.980000,161.910000,157.875000,22491.000000,3.727192e+08
75%,6005191.0,208.500000,209.457500,212.175000,205.945000,36759.500000,7.486596e+08
max,6005191.0,800.000000,799.190000,803.500000,788.880000,406318.000000,1.066339e+10

In [48]:
result=贵州茅台['open'].unique()

In [49]:
result2=贵州茅台['open'].nunique()

In [50]:
result3=贵州茅台['open'].value_counts()

按列索引直接传进去
按照行查找用索引器loc，那一天，那一列